benchmark/results/otel-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * steady: 20 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 79 complete and 0 interrupted iterations
steady   [   2% ] 20 VUs  0m01.0s/1m0s

running (0m02.0s), 20/20 VUs, 172 complete and 0 interrupted iterations
steady   [   3% ] 20 VUs  0m02.0s/1m0s

running (0m03.0s), 20/20 VUs, 268 complete and 0 interrupted iterations
steady   [   5% ] 20 VUs  0m03.0s/1m0s

running (0m04.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
steady   [   7% ] 20 VUs  0m04.0s/1m0s

running (0m05.0s), 20/20 VUs, 470 complete and 0 interrupted iterations
steady   [   8% ] 20 VUs  0m05.0s/1m0s

running (0m06.0s), 20/20 VUs, 574 complete and 0 interrupted iterations
steady   [  10% ] 20 VUs  0m06.0s/1m0s

running (0m07.0s), 20/20 VUs, 678 complete and 0 interrupted iterations
steady   [  12% ] 20 VUs  0m07.0s/1m0s

running (0m08.0s), 20/20 VUs, 767 complete and 0 interrupted iterations
steady   [  13% ] 20 VUs  0m08.0s/1m0s

running (0m09.0s), 20/20 VUs, 871 complete and 0 interrupted iterations
steady   [  15% ] 20 VUs  0m09.0s/1m0s

running (0m10.0s), 20/20 VUs, 960 complete and 0 interrupted iterations
steady   [  17% ] 20 VUs  0m10.0s/1m0s

running (0m11.0s), 20/20 VUs, 1046 complete and 0 interrupted iterations
steady   [  18% ] 20 VUs  0m11.0s/1m0s

running (0m12.0s), 20/20 VUs, 1146 complete and 0 interrupted iterations
steady   [  20% ] 20 VUs  0m12.0s/1m0s

running (0m13.0s), 20/20 VUs, 1229 complete and 0 interrupted iterations
steady   [  22% ] 20 VUs  0m13.0s/1m0s

running (0m14.0s), 20/20 VUs, 1331 complete and 0 interrupted iterations
steady   [  23% ] 20 VUs  0m14.0s/1m0s

running (0m15.0s), 20/20 VUs, 1428 complete and 0 interrupted iterations
steady   [  25% ] 20 VUs  0m15.0s/1m0s

running (0m16.0s), 20/20 VUs, 1520 complete and 0 interrupted iterations
steady   [  27% ] 20 VUs  0m16.0s/1m0s

running (0m17.0s), 20/20 VUs, 1612 complete and 0 interrupted iterations
steady   [  28% ] 20 VUs  0m17.0s/1m0s

running (0m18.0s), 20/20 VUs, 1710 complete and 0 interrupted iterations
steady   [  30% ] 20 VUs  0m18.0s/1m0s

running (0m19.0s), 20/20 VUs, 1812 complete and 0 interrupted iterations
steady   [  32% ] 20 VUs  0m19.0s/1m0s

running (0m20.0s), 20/20 VUs, 1902 complete and 0 interrupted iterations
steady   [  33% ] 20 VUs  0m20.0s/1m0s

running (0m21.0s), 20/20 VUs, 2004 complete and 0 interrupted iterations
steady   [  35% ] 20 VUs  0m21.0s/1m0s

running (0m22.0s), 20/20 VUs, 2093 complete and 0 interrupted iterations
steady   [  37% ] 20 VUs  0m22.0s/1m0s

running (0m23.0s), 20/20 VUs, 2184 complete and 0 interrupted iterations
steady   [  38% ] 20 VUs  0m23.0s/1m0s

running (0m24.0s), 20/20 VUs, 2263 complete and 0 interrupted iterations
steady   [  40% ] 20 VUs  0m24.0s/1m0s

running (0m25.0s), 20/20 VUs, 2353 complete and 0 interrupted iterations
steady   [  42% ] 20 VUs  0m25.0s/1m0s

running (0m26.0s), 20/20 VUs, 2457 complete and 0 interrupted iterations
steady   [  43% ] 20 VUs  0m26.0s/1m0s

running (0m27.0s), 20/20 VUs, 2538 complete and 0 interrupted iterations
steady   [  45% ] 20 VUs  0m27.0s/1m0s

running (0m28.0s), 20/20 VUs, 2640 complete and 0 interrupted iterations
steady   [  47% ] 20 VUs  0m28.0s/1m0s

running (0m29.0s), 20/20 VUs, 2731 complete and 0 interrupted iterations
steady   [  48% ] 20 VUs  0m29.0s/1m0s

running (0m30.0s), 20/20 VUs, 2832 complete and 0 interrupted iterations
steady   [  50% ] 20 VUs  0m30.0s/1m0s

running (0m31.0s), 20/20 VUs, 2901 complete and 0 interrupted iterations
steady   [  52% ] 20 VUs  0m31.0s/1m0s

running (0m32.0s), 20/20 VUs, 2989 complete and 0 interrupted iterations
steady   [  53% ] 20 VUs  0m32.0s/1m0s

running (0m33.0s), 20/20 VUs, 3094 complete and 0 interrupted iterations
steady   [  55% ] 20 VUs  0m33.0s/1m0s

running (0m34.0s), 20/20 VUs, 3183 complete and 0 interrupted iterations
steady   [  57% ] 20 VUs  0m34.0s/1m0s

running (0m35.0s), 20/20 VUs, 3282 complete and 0 interrupted iterations
steady   [  58% ] 20 VUs  0m35.0s/1m0s

running (0m36.0s), 20/20 VUs, 3381 complete and 0 interrupted iterations
steady   [  60% ] 20 VUs  0m36.0s/1m0s

running (0m37.0s), 20/20 VUs, 3470 complete and 0 interrupted iterations
steady   [  62% ] 20 VUs  0m37.0s/1m0s

running (0m38.0s), 20/20 VUs, 3562 complete and 0 interrupted iterations
steady   [  63% ] 20 VUs  0m38.0s/1m0s

running (0m39.0s), 20/20 VUs, 3659 complete and 0 interrupted iterations
steady   [  65% ] 20 VUs  0m39.0s/1m0s

running (0m40.0s), 20/20 VUs, 3741 complete and 0 interrupted iterations
steady   [  67% ] 20 VUs  0m40.0s/1m0s

running (0m41.0s), 20/20 VUs, 3833 complete and 0 interrupted iterations
steady   [  68% ] 20 VUs  0m41.0s/1m0s

running (0m42.0s), 20/20 VUs, 3935 complete and 0 interrupted iterations
steady   [  70% ] 20 VUs  0m42.0s/1m0s

running (0m43.0s), 20/20 VUs, 4023 complete and 0 interrupted iterations
steady   [  72% ] 20 VUs  0m43.0s/1m0s

running (0m44.0s), 20/20 VUs, 4114 complete and 0 interrupted iterations
steady   [  73% ] 20 VUs  0m44.0s/1m0s

running (0m45.0s), 20/20 VUs, 4205 complete and 0 interrupted iterations
steady   [  75% ] 20 VUs  0m45.0s/1m0s

running (0m46.0s), 20/20 VUs, 4302 complete and 0 interrupted iterations
steady   [  77% ] 20 VUs  0m46.0s/1m0s

running (0m47.0s), 20/20 VUs, 4399 complete and 0 interrupted iterations
steady   [  78% ] 20 VUs  0m47.0s/1m0s

running (0m48.0s), 20/20 VUs, 4498 complete and 0 interrupted iterations
steady   [  80% ] 20 VUs  0m48.0s/1m0s

running (0m49.0s), 20/20 VUs, 4590 complete and 0 interrupted iterations
steady   [  82% ] 20 VUs  0m49.0s/1m0s

running (0m50.0s), 20/20 VUs, 4679 complete and 0 interrupted iterations
steady   [  83% ] 20 VUs  0m50.0s/1m0s

running (0m51.0s), 20/20 VUs, 4782 complete and 0 interrupted iterations
steady   [  85% ] 20 VUs  0m51.0s/1m0s

running (0m52.0s), 20/20 VUs, 4876 complete and 0 interrupted iterations
steady   [  87% ] 20 VUs  0m52.0s/1m0s

running (0m53.0s), 20/20 VUs, 4982 complete and 0 interrupted iterations
steady   [  88% ] 20 VUs  0m53.0s/1m0s

running (0m54.0s), 20/20 VUs, 5075 complete and 0 interrupted iterations
steady   [  90% ] 20 VUs  0m54.0s/1m0s

running (0m55.0s), 20/20 VUs, 5153 complete and 0 interrupted iterations
steady   [  92% ] 20 VUs  0m55.0s/1m0s

running (0m56.0s), 20/20 VUs, 5250 complete and 0 interrupted iterations
steady   [  93% ] 20 VUs  0m56.0s/1m0s

running (0m57.0s), 20/20 VUs, 5338 complete and 0 interrupted iterations
steady   [  95% ] 20 VUs  0m57.0s/1m0s

running (0m58.0s), 20/20 VUs, 5423 complete and 0 interrupted iterations
steady   [  97% ] 20 VUs  0m58.0s/1m0s

running (0m59.0s), 20/20 VUs, 5508 complete and 0 interrupted iterations
steady   [  98% ] 20 VUs  0m59.0s/1m0s

running (1m00.0s), 20/20 VUs, 5613 complete and 0 interrupted iterations
steady   [ 100% ] 20 VUs  1m00.0s/1m0s

     ✓ status 200

     checks.........................: 100.00% 5633 out of 5633
     data_received..................: 992 kB  17 kB/s
     data_sent......................: 581 kB  9.6 kB/s
     http_req_blocked...............: avg=22.9µs   min=917ns    med=3.37µs   max=7.04ms   p(90)=4.87µs   p(95)=7.04µs   p(99)=21.79µs 
     http_req_connecting............: avg=13.41µs  min=0s       med=0s       max=5.62ms   p(90)=0s       p(95)=0s       p(99)=0s      
   ✓ http_req_duration..............: avg=112.39ms min=9.41ms   med=88.78ms  max=1.08s    p(90)=234.81ms p(95)=288.41ms p(99)=559.51ms
       { expected_response:true }...: avg=112.39ms min=9.41ms   med=88.78ms  max=1.08s    p(90)=234.81ms p(95)=288.41ms p(99)=559.51ms
   ✓ http_req_failed................: 0.00%   0 out of 5633
     http_req_receiving.............: avg=55.81µs  min=6.79µs   med=51µs     max=1.43ms   p(90)=86.45µs  p(95)=103.64µs p(99)=141.84µs
     http_req_sending...............: avg=11.75µs  min=2.54µs   med=10.41µs  max=692.33µs p(90)=15.74µs  p(95)=20.83µs  p(99)=47.78µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=112.32ms min=9.36ms   med=88.71ms  max=1.08s    p(90)=234.76ms p(95)=288.35ms p(99)=559.46ms
     http_reqs......................: 5633    93.493858/s
     iteration_duration.............: avg=213.43ms min=109.55ms med=189.92ms max=1.18s    p(90)=335.81ms p(95)=389.19ms p(99)=660.54ms
     iterations.....................: 5633    93.493858/s
     vus............................: 20      min=20           max=20
     vus_max........................: 20      min=20           max=20


running (1m00.2s), 00/20 VUs, 5633 complete and 0 interrupted iterations
steady ✓ [ 100% ] 20 VUs  1m0s